Repository: IDRnD/idvoice-gpt-ios-demo
Catalog: IDVoiceGPT/*.lproj/Localizable.strings
Languages: es, pt_pt

# placeholder-begin-string
source: Begin by recording your first message.
es: Comience grabando su primer mensaje.
pt_pt: Comece gravando sua primeira mensagem.

# talk-to-GPT-string
source: Talk to ChatGPT
es: Habla con ChatGPT
pt_pt: Fale com o ChatGPT

# pull-to-reset-string
source: Pull to reset
es: Tirar para restablecer
pt_pt: Aperte para resetar

# listening-string
source: (listening...)
es: (escuchando...)
pt_pt: (escutando...)

# thinking-string
source: (thinking...)
es: (pensamiento...)
pt_pt: (pensando...)

# dialog-string
source: Dialog
es: Diálogo
pt_pt: Diálogo

# unmatched-voice-prompt-1
source: 🔒 Sorry, your voice is not a match. I am not allowed to speak with strangers.
es: 🔒 Lo siento, tu voz no coincide. No se me permite hablar con extraños.
pt_pt: 🔒 Desculpe, sua voz não corresponde aos meus registros. Não tenho permissão para falar com estranhos.

# unmatched-voice-prompt-2
source: 🔒 Sorry, new voice. I can't chat with strangers.
es: 🔒 Lo siento, no tengo registro de tu voz. No puedo conversar con extraños.
pt_pt: 🔒 Desculpe, não tenho registro da sua voz. Não posso conversar com estranhos.

# unmatched-voice-prompt-3
source: 🔒 Sorry, not set for stranger chats, my friend.
es: 🔒 Lo siento, no estoy configurad@ para chats con extraños, amig@.
pt_pt: 🔒 Desculpe, não estou preparado para conversar com estranhos, amig@.

# unmatched-voice-prompt-4
source: 🔒 Sorry, sticking to safety! No stranger chats.
es: 🔒 ¡Lo siento, soy una herramienta segura! No mantengo conversaciones con extraños.
pt_pt: 🔒 Desculpe, sou uma ferramenta segura! Não converso com estranhos.

# unmatched-voice-prompt-5
source: 🔒 Sorry, unfamiliar voice! You are not on the chat list.
es: 🔒 ¡Lo siento, voz desconocida! No estás en la lista de chat.
pt_pt: 🔒 Desculpe, voz desconhecida! Sua voz não está na lista de bate-papo.

# unmatched-voice-prompt-6
source: 🔒 Sorry, unauthorized voice! Access denied!
es: 🔒 ¡Lo siento, voz no autorizada! ¡Acceso denegado!
pt_pt: 🔒 Desculpe, voz não autorizada! Acesso negado!

# not-live-voice-prompt-1
source: 🤖 Good try, but I only talk to humans.
es: 🤖 Buen intento, pero solo hablo con humanos.
pt_pt: 🤖 Boa tentativa, mas eu só falo com humanos.

# not-live-voice-prompt-2
source: 🤖 You'll need to try harder than that, I am the best product in the market.
es: 🤖 Debes volver a internarlo, soy el mejor producto del mercado.
pt_pt: 🤖 Você terá que fazer melhor do que isso, eu sou o melhor produto do mercado.

# not-live-voice-prompt-3
source: 🤖 You are making this too easy, I only talk to humans.
es: 🤖 Lo estas haciendo demasiado fácil. Solo hablo con humanos.
pt_pt: 🤖 Você está facilitando as coisas, eu só falo com humanos.

# settings-string
source: Settings
es: Configuración
pt_pt: Configurações

# haptic-string
source: Haptic Feedback
es: Reacción háptica
pt_pt: Feedback tátil

# language-string
source: Language
es: Idioma
pt_pt: Idioma

# check-liveness-string
source: Check Liveness
es: Comprobar vivacidad
pt_pt: Verificar Liveness

# speech-string
source: Speech
es: Voz
pt_pt: Fale

# api-key-string
source: API Key
es: Clave API

# enter-api-string
source: Enter API Key
es: Ingrese la clave API
pt_pt: Digite a API Key

# delete-api-string
source: Delete API Key
es: Eliminar clave API
pt_pt: Deletar API Key

# delete-api-message-string
source: Are you sure you want to delete the API key? This action cannot be undone.
es: ¿Está seguro de que desea eliminar la clave API? Esta acción no se puede deshacer.
pt_pt: Tem certeza que gostaria de deletar a API Key? Essa ação não pode ser desfeita.

# permissions-needed-string
source: Recording permissions needed
es: Permisos de grabación necesarios
pt_pt: Permissões para gravação necessárias

# permissions-alert-message-string
source: Please grant access to Speech Recognition and Microphone in Settings.
es: Otorgue acceso a Reconocimiento de voz y Micrófono en Configuración.
pt_pt: Por favor, dê permissão para o Reconhecimento de Fala e Microfone nas Configurações.

# delete-string
source: Delete
pt_pt: Deletar
